print("Привет я Джарвис")
print("давай поговорим или я расскажу тебе шутку,")
print("а может я отвечу на твой вопрос или посоветую развлечения")
print("устал(а) общатся? напиши off")
print("ключевые слова (-давай поговорим-, -пошути-, -посоветуй развлечения-, -ответь на вопрос-)")
zadacha =  input("чем займемся сегодня: ").lower()
while zadacha != "off":
    if zadacha == "давай поговорим":
        print("Отлично, давай поговорим!")
        
        otvet = input("как прошел твой день?")
        print("звучит замечательно!")
        
        otvet = input("чем ты сегодня занимался?")
        print("понятно!")
        
        otvet = input("тебе понравился сегодняшний день?")
        print("рада это слышать")
        zadacha =  input("чем займемся сейчас: ").lower()
    elif zadacha == "пошути":
        print("почему программист так радуеться, когда выводит hello, world?")
        print("потому что это единственный собеседник, который гарантированно отвечает без багов!")
        print("надеюсь вам понравилась шутка...")
        zadacha =  input("чем займемся сейчас: ").lower()
    elif zadacha == "посоветуй развлечения":
        print("вот несколько вариантов развлечений:")
        print("можно посмотреть фильм ''бегущий по лезвию 2049''")
        print("можно поиграть в CS:GO")
        print("можно погулять на свежем воздухе")
        zadacha =  input("чем займемся сейчас: ").lower()
    elif zadacha == "ответь на вопрос":
        print("конечно! какой вопрос вас интересует?")
        print("часто задаваемые вопросы: ''робот может сочинить симфонию?'', ''ты умеешь грустить по Wi-FI?''")
        vopros = input("вопрос:").lower()
        if vopros == "робот может сочинить симфонию?".lower():
            print("а вы можете?")
        elif vopros == "ты умеешь грустить по Wi-FI?".lower():
            print("а ты умеешь пить ушами?")
        else:
            print("я незнаю ответа")
        zadacha =  input("чем займемся сейчас: ").lower()
    else:
        print("я пока незнаю такую команду")
        print("попробуйте написать одно из ключевых слов")
        print("ключевые слова (-давай поговорим-, -пошути-, -посоветуй развлечения-, -ответь на вопрос-)")
        zadacha =  input("чем займемся сейчас: ").lower()
print("завершение работы, до встречи!")
 
